GopalSaraf/Practicals/PSDL/include/proc/pic16lf1613.inc
// Register: IOCAF
#define IOCAF IOCAF
IOCAF                                    equ 0393h
// bitfield definitions
IOCAF_IOCAF0_POSN                        equ 0000h
IOCAF_IOCAF0_POSITION                    equ 0000h
IOCAF_IOCAF0_SIZE                        equ 0001h
IOCAF_IOCAF0_LENGTH                      equ 0001h
IOCAF_IOCAF0_MASK                        equ 0001h
IOCAF_IOCAF1_POSN                        equ 0001h
IOCAF_IOCAF1_POSITION                    equ 0001h
IOCAF_IOCAF1_SIZE                        equ 0001h
IOCAF_IOCAF1_LENGTH                      equ 0001h
IOCAF_IOCAF1_MASK                        equ 0002h
IOCAF_IOCAF2_POSN                        equ 0002h
IOCAF_IOCAF2_POSITION                    equ 0002h
IOCAF_IOCAF2_SIZE                        equ 0001h
IOCAF_IOCAF2_LENGTH                      equ 0001h
IOCAF_IOCAF2_MASK                        equ 0004h
IOCAF_IOCAF3_POSN                        equ 0003h
IOCAF_IOCAF3_POSITION                    equ 0003h
IOCAF_IOCAF3_SIZE                        equ 0001h
IOCAF_IOCAF3_LENGTH                      equ 0001h
IOCAF_IOCAF3_MASK                        equ 0008h
IOCAF_IOCAF4_POSN                        equ 0004h
IOCAF_IOCAF4_POSITION                    equ 0004h
IOCAF_IOCAF4_SIZE                        equ 0001h
IOCAF_IOCAF4_LENGTH                      equ 0001h
IOCAF_IOCAF4_MASK                        equ 0010h
IOCAF_IOCAF5_POSN                        equ 0005h
IOCAF_IOCAF5_POSITION                    equ 0005h
IOCAF_IOCAF5_SIZE                        equ 0001h
IOCAF_IOCAF5_LENGTH                      equ 0001h
IOCAF_IOCAF5_MASK                        equ 0020h
IOCAF_IOCAF_POSN                         equ 0000h
IOCAF_IOCAF_POSITION                     equ 0000h
IOCAF_IOCAF_SIZE                         equ 0006h
IOCAF_IOCAF_LENGTH                       equ 0006h
IOCAF_IOCAF_MASK                         equ 003Fh

// Register: IOCCP
#define IOCCP IOCCP
IOCCP                                    equ 0397h
// bitfield definitions
IOCCP_IOCCP0_POSN                        equ 0000h
IOCCP_IOCCP0_POSITION                    equ 0000h
IOCCP_IOCCP0_SIZE                        equ 0001h
IOCCP_IOCCP0_LENGTH                      equ 0001h
IOCCP_IOCCP0_MASK                        equ 0001h
IOCCP_IOCCP1_POSN                        equ 0001h
IOCCP_IOCCP1_POSITION                    equ 0001h
IOCCP_IOCCP1_SIZE                        equ 0001h
IOCCP_IOCCP1_LENGTH                      equ 0001h
IOCCP_IOCCP1_MASK                        equ 0002h
IOCCP_IOCCP2_POSN                        equ 0002h
IOCCP_IOCCP2_POSITION                    equ 0002h
IOCCP_IOCCP2_SIZE                        equ 0001h
IOCCP_IOCCP2_LENGTH                      equ 0001h
IOCCP_IOCCP2_MASK                        equ 0004h
IOCCP_IOCCP3_POSN                        equ 0003h
IOCCP_IOCCP3_POSITION                    equ 0003h
IOCCP_IOCCP3_SIZE                        equ 0001h
IOCCP_IOCCP3_LENGTH                      equ 0001h
IOCCP_IOCCP3_MASK                        equ 0008h
IOCCP_IOCCP4_POSN                        equ 0004h
IOCCP_IOCCP4_POSITION                    equ 0004h
IOCCP_IOCCP4_SIZE                        equ 0001h
IOCCP_IOCCP4_LENGTH                      equ 0001h
IOCCP_IOCCP4_MASK                        equ 0010h
IOCCP_IOCCP5_POSN                        equ 0005h
IOCCP_IOCCP5_POSITION                    equ 0005h
IOCCP_IOCCP5_SIZE                        equ 0001h
IOCCP_IOCCP5_LENGTH                      equ 0001h
IOCCP_IOCCP5_MASK                        equ 0020h

// Register: IOCCN
#define IOCCN IOCCN
IOCCN                                    equ 0398h
// bitfield definitions
IOCCN_IOCCN0_POSN                        equ 0000h
IOCCN_IOCCN0_POSITION                    equ 0000h
IOCCN_IOCCN0_SIZE                        equ 0001h
IOCCN_IOCCN0_LENGTH                      equ 0001h
IOCCN_IOCCN0_MASK                        equ 0001h
IOCCN_IOCCN1_POSN                        equ 0001h
IOCCN_IOCCN1_POSITION                    equ 0001h
IOCCN_IOCCN1_SIZE                        equ 0001h
IOCCN_IOCCN1_LENGTH                      equ 0001h
IOCCN_IOCCN1_MASK                        equ 0002h
IOCCN_IOCCN2_POSN                        equ 0002h
IOCCN_IOCCN2_POSITION                    equ 0002h
IOCCN_IOCCN2_SIZE                        equ 0001h
IOCCN_IOCCN2_LENGTH                      equ 0001h
IOCCN_IOCCN2_MASK                        equ 0004h
IOCCN_IOCCN3_POSN                        equ 0003h
IOCCN_IOCCN3_POSITION                    equ 0003h
IOCCN_IOCCN3_SIZE                        equ 0001h
IOCCN_IOCCN3_LENGTH                      equ 0001h
IOCCN_IOCCN3_MASK                        equ 0008h
IOCCN_IOCCN4_POSN                        equ 0004h
IOCCN_IOCCN4_POSITION                    equ 0004h
IOCCN_IOCCN4_SIZE                        equ 0001h
IOCCN_IOCCN4_LENGTH                      equ 0001h
IOCCN_IOCCN4_MASK                        equ 0010h
IOCCN_IOCCN5_POSN                        equ 0005h
IOCCN_IOCCN5_POSITION                    equ 0005h
IOCCN_IOCCN5_SIZE                        equ 0001h
IOCCN_IOCCN5_LENGTH                      equ 0001h
IOCCN_IOCCN5_MASK                        equ 0020h

// Register: IOCCF
#define IOCCF IOCCF
IOCCF                                    equ 0399h
// bitfield definitions
IOCCF_IOCCF0_POSN                        equ 0000h
IOCCF_IOCCF0_POSITION                    equ 0000h
IOCCF_IOCCF0_SIZE                        equ 0001h
IOCCF_IOCCF0_LENGTH                      equ 0001h
IOCCF_IOCCF0_MASK                        equ 0001h
IOCCF_IOCCF1_POSN                        equ 0001h
IOCCF_IOCCF1_POSITION                    equ 0001h
IOCCF_IOCCF1_SIZE                        equ 0001h
IOCCF_IOCCF1_LENGTH                      equ 0001h
IOCCF_IOCCF1_MASK                        equ 0002h
IOCCF_IOCCF2_POSN                        equ 0002h
IOCCF_IOCCF2_POSITION                    equ 0002h
IOCCF_IOCCF2_SIZE                        equ 0001h
IOCCF_IOCCF2_LENGTH                      equ 0001h
IOCCF_IOCCF2_MASK                        equ 0004h
IOCCF_IOCCF3_POSN                        equ 0003h
IOCCF_IOCCF3_POSITION                    equ 0003h
IOCCF_IOCCF3_SIZE                        equ 0001h
IOCCF_IOCCF3_LENGTH                      equ 0001h
IOCCF_IOCCF3_MASK                        equ 0008h
IOCCF_IOCCF4_POSN                        equ 0004h
IOCCF_IOCCF4_POSITION                    equ 0004h
IOCCF_IOCCF4_SIZE                        equ 0001h
IOCCF_IOCCF4_LENGTH                      equ 0001h
IOCCF_IOCCF4_MASK                        equ 0010h
IOCCF_IOCCF5_POSN                        equ 0005h
IOCCF_IOCCF5_POSITION                    equ 0005h
IOCCF_IOCCF5_SIZE                        equ 0001h
IOCCF_IOCCF5_LENGTH                      equ 0001h
IOCCF_IOCCF5_MASK                        equ 0020h

// Register: T4TMR
#define T4TMR T4TMR
T4TMR                                    equ 0413h
// bitfield definitions
T4TMR_TMR4_POSN                          equ 0000h
T4TMR_TMR4_POSITION                      equ 0000h
T4TMR_TMR4_SIZE                          equ 0008h
T4TMR_TMR4_LENGTH                        equ 0008h
T4TMR_TMR4_MASK                          equ 00FFh

// Register: T4PR
#define T4PR T4PR
T4PR                                     equ 0414h
// bitfield definitions
T4PR_PR4_POSN                            equ 0000h
T4PR_PR4_POSITION                        equ 0000h
T4PR_PR4_SIZE                            equ 0008h
T4PR_PR4_LENGTH                          equ 0008h
T4PR_PR4_MASK                            equ 00FFh

// Register: T4CON
#define T4CON T4CON
T4CON                                    equ 0415h
// bitfield definitions
T4CON_OUTPS_POSN                         equ 0000h
T4CON_OUTPS_POSITION                     equ 0000h
T4CON_OUTPS_SIZE                         equ 0004h
T4CON_OUTPS_LENGTH                       equ 0004h
T4CON_OUTPS_MASK                         equ 000Fh
T4CON_CKPS_POSN                          equ 0004h
T4CON_CKPS_POSITION                      equ 0004h
T4CON_CKPS_SIZE                          equ 0003h
T4CON_CKPS_LENGTH                        equ 0003h
T4CON_CKPS_MASK                          equ 0070h
T4CON_ON_POSN                            equ 0007h
T4CON_ON_POSITION                        equ 0007h
T4CON_ON_SIZE                            equ 0001h
T4CON_ON_LENGTH                          equ 0001h
T4CON_ON_MASK                            equ 0080h
T4CON_T4OUTPS_POSN                       equ 0000h
T4CON_T4OUTPS_POSITION                   equ 0000h
T4CON_T4OUTPS_SIZE                       equ 0004h
T4CON_T4OUTPS_LENGTH                     equ 0004h
T4CON_T4OUTPS_MASK                       equ 000Fh
T4CON_T4CKPS_POSN                        equ 0004h
T4CON_T4CKPS_POSITION                    equ 0004h
T4CON_T4CKPS_SIZE                        equ 0003h
T4CON_T4CKPS_LENGTH                      equ 0003h
T4CON_T4CKPS_MASK                        equ 0070h
T4CON_T4ON_POSN                          equ 0007h
T4CON_T4ON_POSITION                      equ 0007h
T4CON_T4ON_SIZE                          equ 0001h
T4CON_T4ON_LENGTH                        equ 0001h
T4CON_T4ON_MASK                          equ 0080h
T4CON_T4OUTPS0_POSN                      equ 0000h
T4CON_T4OUTPS0_POSITION                  equ 0000h
T4CON_T4OUTPS0_SIZE                      equ 0001h
T4CON_T4OUTPS0_LENGTH                    equ 0001h
T4CON_T4OUTPS0_MASK                      equ 0001h
T4CON_T4OUTPS1_POSN                      equ 0001h
T4CON_T4OUTPS1_POSITION                  equ 0001h
T4CON_T4OUTPS1_SIZE                      equ 0001h
T4CON_T4OUTPS1_LENGTH                    equ 0001h
T4CON_T4OUTPS1_MASK                      equ 0002h
T4CON_T4OUTPS2_POSN                      equ 0002h
T4CON_T4OUTPS2_POSITION                  equ 0002h
T4CON_T4OUTPS2_SIZE                      equ 0001h
T4CON_T4OUTPS2_LENGTH                    equ 0001h
T4CON_T4OUTPS2_MASK                      equ 0004h
T4CON_T4OUTPS3_POSN                      equ 0003h
T4CON_T4OUTPS3_POSITION                  equ 0003h
T4CON_T4OUTPS3_SIZE                      equ 0001h
T4CON_T4OUTPS3_LENGTH                    equ 0001h
T4CON_T4OUTPS3_MASK                      equ 0008h
T4CON_T4CKPS0_POSN                       equ 0004h
T4CON_T4CKPS0_POSITION                   equ 0004h
T4CON_T4CKPS0_SIZE                       equ 0001h
T4CON_T4CKPS0_LENGTH                     equ 0001h
T4CON_T4CKPS0_MASK                       equ 0010h
T4CON_T4CKPS1_POSN                       equ 0005h
T4CON_T4CKPS1_POSITION                   equ 0005h
T4CON_T4CKPS1_SIZE                       equ 0001h
T4CON_T4CKPS1_LENGTH                     equ 0001h
T4CON_T4CKPS1_MASK                       equ 0020h
T4CON_T4CKPS2_POSN                       equ 0006h
T4CON_T4CKPS2_POSITION                   equ 0006h
T4CON_T4CKPS2_SIZE                       equ 0001h
T4CON_T4CKPS2_LENGTH                     equ 0001h
T4CON_T4CKPS2_MASK                       equ 0040h
T4CON_OUTPS0_POSN                        equ 0000h
T4CON_OUTPS0_POSITION                    equ 0000h
T4CON_OUTPS0_SIZE                        equ 0001h
T4CON_OUTPS0_LENGTH                      equ 0001h
T4CON_OUTPS0_MASK                        equ 0001h
T4CON_OUTPS1_POSN                        equ 0001h
T4CON_OUTPS1_POSITION                    equ 0001h
T4CON_OUTPS1_SIZE                        equ 0001h
T4CON_OUTPS1_LENGTH                      equ 0001h
T4CON_OUTPS1_MASK                        equ 0002h
T4CON_OUTPS2_POSN                        equ 0002h
T4CON_OUTPS2_POSITION                    equ 0002h
T4CON_OUTPS2_SIZE                        equ 0001h
T4CON_OUTPS2_LENGTH                      equ 0001h
T4CON_OUTPS2_MASK                        equ 0004h
T4CON_OUTPS3_POSN                        equ 0003h
T4CON_OUTPS3_POSITION                    equ 0003h
T4CON_OUTPS3_SIZE                        equ 0001h
T4CON_OUTPS3_LENGTH                      equ 0001h
T4CON_OUTPS3_MASK                        equ 0008h
T4CON_CKPS0_POSN                         equ 0004h
T4CON_CKPS0_POSITION                     equ 0004h
T4CON_CKPS0_SIZE                         equ 0001h
T4CON_CKPS0_LENGTH                       equ 0001h
T4CON_CKPS0_MASK                         equ 0010h
T4CON_CKPS1_POSN                         equ 0005h
T4CON_CKPS1_POSITION                     equ 0005h
T4CON_CKPS1_SIZE                         equ 0001h
T4CON_CKPS1_LENGTH                       equ 0001h
T4CON_CKPS1_MASK                         equ 0020h
T4CON_CKPS2_POSN                         equ 0006h
T4CON_CKPS2_POSITION                     equ 0006h
T4CON_CKPS2_SIZE                         equ 0001h
T4CON_CKPS2_LENGTH                       equ 0001h
T4CON_CKPS2_MASK                         equ 0040h
T4CON_TMR4ON_POSN                        equ 0007h
T4CON_TMR4ON_POSITION                    equ 0007h
T4CON_TMR4ON_SIZE                        equ 0001h
T4CON_TMR4ON_LENGTH                      equ 0001h
T4CON_TMR4ON_MASK                        equ 0080h

// Register: T4HLT
#define T4HLT T4HLT
T4HLT                                    equ 0416h
// bitfield definitions
T4HLT_MODE_POSN                          equ 0000h
T4HLT_MODE_POSITION                      equ 0000h
T4HLT_MODE_SIZE                          equ 0004h
T4HLT_MODE_LENGTH                        equ 0004h
T4HLT_MODE_MASK                          equ 000Fh
T4HLT_CKSYNC_POSN                        equ 0005h
T4HLT_CKSYNC_POSITION                    equ 0005h
T4HLT_CKSYNC_SIZE                        equ 0001h
T4HLT_CKSYNC_LENGTH                      equ 0001h
T4HLT_CKSYNC_MASK                        equ 0020h
T4HLT_CKPOL_POSN                         equ 0006h
T4HLT_CKPOL_POSITION                     equ 0006h
T4HLT_CKPOL_SIZE                         equ 0001h
T4HLT_CKPOL_LENGTH                       equ 0001h
T4HLT_CKPOL_MASK                         equ 0040h
T4HLT_PSYNC_POSN                         equ 0007h
T4HLT_PSYNC_POSITION                     equ 0007h
T4HLT_PSYNC_SIZE                         equ 0001h
T4HLT_PSYNC_LENGTH                       equ 0001h
T4HLT_PSYNC_MASK                         equ 0080h
T4HLT_MODE0_POSN                         equ 0000h
T4HLT_MODE0_POSITION                     equ 0000h
T4HLT_MODE0_SIZE                         equ 0001h
T4HLT_MODE0_LENGTH                       equ 0001h
T4HLT_MODE0_MASK                         equ 0001h
T4HLT_MODE1_POSN                         equ 0001h
T4HLT_MODE1_POSITION                     equ 0001h
T4HLT_MODE1_SIZE                         equ 0001h
T4HLT_MODE1_LENGTH                       equ 0001h
T4HLT_MODE1_MASK                         equ 0002h
T4HLT_MODE2_POSN                         equ 0002h
T4HLT_MODE2_POSITION                     equ 0002h
T4HLT_MODE2_SIZE                         equ 0001h
T4HLT_MODE2_LENGTH                       equ 0001h
T4HLT_MODE2_MASK                         equ 0004h
T4HLT_MODE3_POSN                         equ 0003h
T4HLT_MODE3_POSITION                     equ 0003h
T4HLT_MODE3_SIZE                         equ 0001h
T4HLT_MODE3_LENGTH                       equ 0001h
T4HLT_MODE3_MASK                         equ 0008h
T4HLT_T4MODE_POSN                        equ 0000h
T4HLT_T4MODE_POSITION                    equ 0000h
T4HLT_T4MODE_SIZE                        equ 0004h
T4HLT_T4MODE_LENGTH                      equ 0004h
T4HLT_T4MODE_MASK                        equ 000Fh
T4HLT_T4CKSYNC_POSN                      equ 0005h
T4HLT_T4CKSYNC_POSITION                  equ 0005h
T4HLT_T4CKSYNC_SIZE                      equ 0001h
T4HLT_T4CKSYNC_LENGTH                    equ 0001h
T4HLT_T4CKSYNC_MASK                      equ 0020h
T4HLT_T4CKPOL_POSN                       equ 0006h
T4HLT_T4CKPOL_POSITION                   equ 0006h
T4HLT_T4CKPOL_SIZE                       equ 0001h
T4HLT_T4CKPOL_LENGTH                     equ 0001h
T4HLT_T4CKPOL_MASK                       equ 0040h
T4HLT_T4PSYNC_POSN                       equ 0007h
T4HLT_T4PSYNC_POSITION                   equ 0007h
T4HLT_T4PSYNC_SIZE                       equ 0001h
T4HLT_T4PSYNC_LENGTH                     equ 0001h
T4HLT_T4PSYNC_MASK                       equ 0080h
T4HLT_T4MODE0_POSN                       equ 0000h
T4HLT_T4MODE0_POSITION                   equ 0000h
T4HLT_T4MODE0_SIZE                       equ 0001h
T4HLT_T4MODE0_LENGTH                     equ 0001h
T4HLT_T4MODE0_MASK                       equ 0001h
T4HLT_T4MODE1_POSN                       equ 0001h
T4HLT_T4MODE1_POSITION                   equ 0001h
T4HLT_T4MODE1_SIZE                       equ 0001h
T4HLT_T4MODE1_LENGTH                     equ 0001h
T4HLT_T4MODE1_MASK                       equ 0002h
T4HLT_T4MODE2_POSN                       equ 0002h
T4HLT_T4MODE2_POSITION                   equ 0002h
T4HLT_T4MODE2_SIZE                       equ 0001h
T4HLT_T4MODE2_LENGTH                     equ 0001h
T4HLT_T4MODE2_MASK                       equ 0004h
T4HLT_T4MODE3_POSN                       equ 0003h
T4HLT_T4MODE3_POSITION                   equ 0003h
T4HLT_T4MODE3_SIZE                       equ 0001h
T4HLT_T4MODE3_LENGTH                     equ 0001h
T4HLT_T4MODE3_MASK                       equ 0008h

// Register: T4CLKCON
#define T4CLKCON T4CLKCON
T4CLKCON                                 equ 0417h
// bitfield definitions
T4CLKCON_T4CS_POSN                       equ 0000h
T4CLKCON_T4CS_POSITION                   equ 0000h
T4CLKCON_T4CS_SIZE                       equ 0003h
T4CLKCON_T4CS_LENGTH                     equ 0003h
T4CLKCON_T4CS_MASK                       equ 0007h
T4CLKCON_T4CS0_POSN                      equ 0000h
T4CLKCON_T4CS0_POSITION                  equ 0000h
T4CLKCON_T4CS0_SIZE                      equ 0001h
T4CLKCON_T4CS0_LENGTH                    equ 0001h
T4CLKCON_T4CS0_MASK                      equ 0001h
T4CLKCON_T4CS1_POSN                      equ 0001h
T4CLKCON_T4CS1_POSITION                  equ 0001h
T4CLKCON_T4CS1_SIZE                      equ 0001h
T4CLKCON_T4CS1_LENGTH                    equ 0001h
T4CLKCON_T4CS1_MASK                      equ 0002h
T4CLKCON_T4CS2_POSN                      equ 0002h
T4CLKCON_T4CS2_POSITION                  equ 0002h
T4CLKCON_T4CS2_SIZE                      equ 0001h
T4CLKCON_T4CS2_LENGTH                    equ 0001h
T4CLKCON_T4CS2_MASK                      equ 0004h

// Register: T4RST
#define T4RST T4RST
T4RST                                    equ 0418h
// bitfield definitions
T4RST_RSEL_POSN                          equ 0000h
T4RST_RSEL_POSITION                      equ 0000h
T4RST_RSEL_SIZE                          equ 0004h
T4RST_RSEL_LENGTH                        equ 0004h
T4RST_RSEL_MASK                          equ 000Fh
T4RST_RSEL0_POSN                         equ 0000h
T4RST_RSEL0_POSITION                     equ 0000h
T4RST_RSEL0_SIZE                         equ 0001h
T4RST_RSEL0_LENGTH                       equ 0001h
T4RST_RSEL0_MASK                         equ 0001h
T4RST_RSEL1_POSN                         equ 0001h
T4RST_RSEL1_POSITION                     equ 0001h
T4RST_RSEL1_SIZE                         equ 0001h
T4RST_RSEL1_LENGTH                       equ 0001h
T4RST_RSEL1_MASK                         equ 0002h
T4RST_RSEL2_POSN                         equ 0002h
T4RST_RSEL2_POSITION                     equ 0002h
T4RST_RSEL2_SIZE                         equ 0001h
T4RST_RSEL2_LENGTH                       equ 0001h
T4RST_RSEL2_MASK                         equ 0004h
T4RST_RSEL3_POSN                         equ 0003h
T4RST_RSEL3_POSITION                     equ 0003h
T4RST_RSEL3_SIZE                         equ 0001h
T4RST_RSEL3_LENGTH                       equ 0001h
T4RST_RSEL3_MASK                         equ 0008h
T4RST_T4RSEL_POSN                        equ 0000h
T4RST_T4RSEL_POSITION                    equ 0000h
T4RST_T4RSEL_SIZE                        equ 0004h
T4RST_T4RSEL_LENGTH                      equ 0004h
T4RST_T4RSEL_MASK                        equ 000Fh
T4RST_T4RSEL0_POSN                       equ 0000h
T4RST_T4RSEL0_POSITION                   equ 0000h
T4RST_T4RSEL0_SIZE                       equ 0001h
T4RST_T4RSEL0_LENGTH                     equ 0001h
T4RST_T4RSEL0_MASK                       equ 0001h
T4RST_T4RSEL1_POSN                       equ 0001h
T4RST_T4RSEL1_POSITION                   equ 0001h
T4RST_T4RSEL1_SIZE                       equ 0001h
T4RST_T4RSEL1_LENGTH                     equ 0001h
T4RST_T4RSEL1_MASK                       equ 0002h
T4RST_T4RSEL2_POSN                       equ 0002h
T4RST_T4RSEL2_POSITION                   equ 0002h
T4RST_T4RSEL2_SIZE                       equ 0001h
T4RST_T4RSEL2_LENGTH                     equ 0001h
T4RST_T4RSEL2_MASK                       equ 0004h
T4RST_T4RSEL3_POSN                       equ 0003h
T4RST_T4RSEL3_POSITION                   equ 0003h
T4RST_T4RSEL3_SIZE                       equ 0001h
T4RST_T4RSEL3_LENGTH                     equ 0001h
T4RST_T4RSEL3_MASK                       equ 0008h

// Register: T6TMR
#define T6TMR T6TMR
T6TMR                                    equ 041Ah
// bitfield definitions
T6TMR_TMR6_POSN                          equ 0000h
T6TMR_TMR6_POSITION                      equ 0000h
T6TMR_TMR6_SIZE                          equ 0008h
T6TMR_TMR6_LENGTH                        equ 0008h
T6TMR_TMR6_MASK                          equ 00FFh

// Register: T6PR
#define T6PR T6PR
T6PR                                     equ 041Bh
// bitfield definitions
T6PR_PR6_POSN                            equ 0000h
T6PR_PR6_POSITION                        equ 0000h
T6PR_PR6_SIZE                            equ 0008h
T6PR_PR6_LENGTH                          equ 0008h
T6PR_PR6_MASK                            equ 00FFh

